app/views/tours/_form.html.erb

      <div class="controls">
        <%= f.select :interest_id, Interest.all.map {|interest| [interest.name,interest.id]}, {:include_blank => "No relacionado"} %>
---
SELECT `interests`.* FROM `interests`