app/controllers/accounts_controller.rb

  def index
    @header_tab = "account"
    @accounts = Account.all
---
SELECT `accounts`.* FROM `accounts`

  def set_account
    @account = Account.find(params[:id])
---
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1