app/controllers/banners_controller.rb

SELECT `banners`.* FROM `banners`
---
  def index
    @banners = Banner.all