app/controllers/home_controller.rb

  def index
    @tours = Tour.order("popularity").where("place = 0 and interest_id is null").all
    @banners = Banner.all
    @reviews = Review.all
---
SELECT `tours`.* FROM `tours` WHERE (place = 0 and interest_id is null)  ORDER BY popularity
SELECT `banners`.* FROM `banners`
SELECT `reviews`.* FROM `reviews` WHERE (home = 1)

  def contact_us
    @header_tab = "contact"
    if request.post?
      QuotesMailer.send_contact(params[:contact]).deliver
      redirect_to :thank_you_contact and return
    end

    @tour = Tour.order("RAND()").first
---
SELECT  `tours`.* FROM `tours`  ORDER BY RAND() LIMIT 6

  def about_us
    @tour = Tour.order("RAND()").first
    @reviews = Review.order("RAND()").limit(10)
---
SELECT  `tours`.* FROM `tours`  ORDER BY RAND() LIMIT 1
SELECT  `reviews`.* FROM `reviews`  ORDER BY RAND() LIMIT 10

  def how_to_pay
    @tour = Tour.order("RAND()").first
---
SELECT  `tours`.* FROM `tours`  ORDER BY RAND() LIMIT 1

  def peru
    @tour = Tour.order("RAND()").first
---
SELECT  `tours`.* FROM `tours`  ORDER BY RAND() LIMIT 1

  def util_information
    @tour = Tour.order("RAND()").first
---
SELECT  `tours`.* FROM `tours`  ORDER BY RAND() LIMIT 1