app/controllers/media_controller.rb

  def index
    @header_tab = "media"
    @media = Media.all
---
SELECT `media`.* FROM `media`