app/controllers/posts_controller.rb

  def index
    if current_account
      @header_tab = "blog"
      @posts = Post.all
      render :layout => "admin"
    else
      @header_tab = "post"
      @posts = Post.order("created_at desc").all.paginate(:page => params[:page],:per_page => 5)
---
SELECT `posts`.* FROM `posts` WHERE (popular = 1)  ORDER BY created_at desc
SELECT  `posts`.* FROM `posts`  ORDER BY created_at desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `posts`