app/controllers/quotes_controller.rb

def create
  @tour = Tour.find(params[:tour_id])
  @quote = Quote.new(params[:quote])
  @quote.tour = @tour
  if @quote.save
---
SELECT  `tours`.* FROM `tours` WHERE `tours`.`id` = 0 LIMIT 1
INSERT INTO `quotes` (`travel_type`, `days`, `adults`, `name`, `country`, `city`, `phone`, `email`, `payment_type`, `comments`, `travel_time`, `tour_id`, `created_at`, `updated_at`) VALUES ('Lujo', 1, 1, 'Giancarlo Corzo', 'PE', 'Lima', '997528963', 'gian.corzo@gmail.com', 'Trans. Bancaria', 'test', '2015-05-31', 1, '2015-05-31 05:37:38', '2015-05-31 05:37:38')

def thank_you
  @tours = Tour.order("popularity").limit(4)
---
SELECT  `tours`.* FROM `tours`  ORDER BY popularity LIMIT 4

def thank_you_contact
  @tours = Tour.order("popularity").limit(4)
---
SELECT  `tours`.* FROM `tours`  ORDER BY popularity LIMIT 4