app/controllers/tours_controller.rb

  def index
    if current_account
      @header_tab = "tour"
      @tours = Tour.all
---
SELECT `tours`.* FROM `tours` WHERE (place = 0 and interest_id is null)  ORDER BY popularity

  def index_by_location
      @header_tab = "location"
      @tours = Tour.order("popularity").where("place = 1")
      if session[:tour_header].nil? then
        @tour = Tour.order("RAND()").first
        session[:tour_header] = @tour.id
      else
        @tour = Tour.find(session[:tour_header])
---
SELECT `tours`.* FROM `tours` WHERE (place = 1)  ORDER BY popularity
SELECT  `tours`.* FROM `tours`  ORDER BY RAND() LIMIT 1
SELECT  `tours`.* FROM `tours` WHERE `tours`.`id` = 31 LIMIT 1

  def index_by_interest
      @header_tab = "interest"
      @tours = Tour.order("popularity").where("interest_id is not null and place = 0").all
      if session[:tour_header].nil? then
        @tour = Tour.order("RAND()").first
        session[:tour_header] = @tour.id
      else
        @tour = Tour.find(session[:tour_header])
      end
      @interests = Interest.all
---
SELECT `tours`.* FROM `tours` WHERE (interest_id is not null and place = 0)  ORDER BY popularity
SELECT  `tours`.* FROM `tours`  ORDER BY RAND() LIMIT 1
SELECT `interests`.* FROM `interests`

  def set_tour
      @tour = Tour.find(params[:id])
---
SELECT  `tours`.* FROM `tours` WHERE `tours`.`id` = 0 LIMIT 1